MakePayment_Init3DPayment/Makeprebooking req

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:trev="http://schemas.datacontract.org/2004/07/Trevoo.WS.Entities.Base" xmlns:trev1="http://schemas.datacontract.org/2004/07/Trevoo.WS.IO.Shopping" xmlns:trev2="http://schemas.datacontract.org/2004/07/Trevoo.WS.Entities.Transfer" xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
	<soapenv:Header/>
	<soapenv:Body>
		<tem:MakePrebooking>
			<tem:request>
				<trev:AuthenticationHeader>
					<trev:SessionId>7537396</trev:SessionId>
					<trev:SessionToken>037f4dfb-d82c-4813-ac09-047395987712</trev:SessionToken>
				</trev:AuthenticationHeader>
				<trev:ExtraParamList>
					<trev:ExtendedData>
						<trev:Name>IntendedShoppingFileId</trev:Name>
						<trev:Value>5f2edb63-cc76-4b46-afe4-95b8a9572f3f</trev:Value>
					</trev:ExtendedData>
					<trev:ExtendedData>
						<trev:Name>DoReservation</trev:Name>
						<trev:Value>true</trev:Value>
					</trev:ExtendedData>
				</trev:ExtraParamList>
				<trev1:Form>
					<trev1:Branded>
						<trev1:IO_Air_Branded_Form>
							<trev1:BrandedFareItemId>53b3630a-fbc1-4197-864c-51dd976629ce</trev1:BrandedFareItemId>
							<trev1:ProductId>d9546a87-e15a-4d14-a6a7-584278ee8ae0</trev1:ProductId>
						</trev1:IO_Air_Branded_Form>
					</trev1:Branded>
					<trev1:CIPRequest/>
					<trev1:ProductIds>
						<arr:guid>d9546a87-e15a-4d14-a6a7-584278ee8ae0</arr:guid>
					</trev1:ProductIds>
				</trev1:Form>
			</tem:request>
		</tem:MakePrebooking>
	</soapenv:Body>
</soapenv:Envelope>